# Read Excel  files with `read_excel()`

### Import Pandas

In [1]:
import pandas as pd

### Install `openpyxl`

In [9]:
# install using conda with --yes flag
# !conda install openpyxl --yes

### `read_excel()` parameters

In [4]:
# press TAB or SHIFT + TAB or SHIFT + TAB + TAB
# pd.read_excel()

### Read Excel

In [5]:
# read_excel method
# press TAB inside
# this is a DataFrame
pd.read_excel('animal_names.xlsx')

                scientific_name      country
0          Cercatetus concinnus   Azerbaijan
1              Lutra canadensis   Kazakhstan
2                Alopex lagopus        China
3              Macropus eugenii  Philippines
4    Calyptorhynchus magnificus     Cambodia
..                          ...          ...
995          Anas platyrhynchos        China
996            Isoodon obesulus        China
997                 Upupa epops       Poland
998               Ratufa indica       Angola
999            Columba palumbus       Canada

[1000 rows x 2 columns]

### `usecols=` to explicitly select columns

In [6]:
# use only one column
pd.read_excel('animal_names.xlsx', usecols=['scientific_name'])

                scientific_name
0          Cercatetus concinnus
1              Lutra canadensis
2                Alopex lagopus
3              Macropus eugenii
4    Calyptorhynchus magnificus
..                          ...
995          Anas platyrhynchos
996            Isoodon obesulus
997                 Upupa epops
998               Ratufa indica
999            Columba palumbus

[1000 rows x 1 columns]

In [7]:
# use only one column
pd.read_excel('animal_names.xlsx', usecols=['country'])

         country
0     Azerbaijan
1     Kazakhstan
2          China
3    Philippines
4       Cambodia
..           ...
995        China
996        China
997       Poland
998       Angola
999       Canada

[1000 rows x 1 columns]

### Squeeze DataFrame into a Series

In [8]:
# squeeze into a Series
# pd.read_excel('animal_names.xlsx', usecols=['scientific_name'], squeeze=True) old way now deprecated
pd.read_excel('animal_names.xlsx', usecols=['scientific_name']).squeeze("columns")

0            Cercatetus concinnus
1                Lutra canadensis
2                  Alopex lagopus
3                Macropus eugenii
4      Calyptorhynchus magnificus
                  ...
995            Anas platyrhynchos
996              Isoodon obesulus
997                   Upupa epops
998                 Ratufa indica
999              Columba palumbus
Name: scientific_name, Length: 1000, dtype: object